0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  13
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// Startwert im ganzen Feld (kannst du so lassen)
internalField   uniform (0.02 1e-3 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.02 0 0);   // Uin
    }

    outlet
    {
        type            zeroGradient;
    }

    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);   // noSlip
    }

    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);   // noSlip
    }

    cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);   // noSlip
    }

    frontAndBack
    {
        type            symmetry;             // 2D
    }
}

// ************************************************************************* //
