system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  13
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;   // stabil für transient (alternativ: Euler)
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    // Konvektionsterm für Impuls: stabil + nicht zu diffusive
    div(phi,U)      Gauss limitedLinearV 1;

    // Viskoser Term wird i.d.R. als laplacian umgesetzt, daher hier nichts extra nötig
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
}

// ************************************************************************* //
